In [21]:
import numpy
import pandas

In [22]:
data = pandas.read_csv('Telecust1.csv')
df = pandas.DataFrame(data)
df

,region,tenure,age,income,marital,address,ed,employ,retire,gender,reside,custcat
0,2,13,44,64,1,9,4,5,0,0,2,A
1,3,11,33,136,1,7,5,5,0,0,6,D
2,3,68,52,116,1,24,1,29,0,1,2,C
3,2,33,33,33,0,12,2,0,0,1,1,A
4,2,23,30,30,1,9,1,2,0,0,4,C
...,...,...,...,...,...,...,...,...,...,...,...,...
995,3,10,39,27,0,0,3,0,0,1,3,A
996,1,7,34,22,0,2,5,5,0,1,1,A
997,3,67,59,944,0,40,5,33,0,1,1,D
998,3,70,49,87,0,18,2,22,0,1,1,C
999,3,50,36,39,1,7,3,3,0,1,3,B

In [23]:
#1
df.head()
#2
df.describe()
#3
df.isna().sum()
#4
df['custcat'].unique()
#5
df[df['income'] > 100]
#6
df[(df['marital'] == 1) & (df['age'] < 40)]
#7
df[(df['gender'] == 0) & (df['retire'] == 1)]
#8
df[df['ed'] > 3]
#9
df.groupby('custcat')['income'].mean()
#10
df.groupby('region')['ed'].count()
#11
df.groupby('marital')['age'].max()
#12
df.groupby('reside')['income'].sum()
#13
df.groupby('gender')[['tenure','income','employ']].mean()
#14
df['income_level'] = df['income'].apply(lambda a: 'High' if a > 100 else ("Medium" if (a > 50) and (a <= 100) else "Low"))
df
#15
df['senior_citizen'] = df['age'].apply(lambda c: 1 if c > 60 else 0)
#16
df['years_until_retirement'] = df['age'].apply(lambda d: (60-d))
df
#17
df[(df['income'] > 100) & (df['ed'] > 3)]
#18
df[(df['marital'] == 0) & (df['income'] > 50) & (df['income'] < 100)]
#19
df.loc[:,['region','age','income','custcat']]
#20
df.tail(3)
#21
# Rename employ to years_employed
df.rename(columns={'employ':'years_employed'})
#22
df['gender'] = df['gender'].replace({0 : "Female",1 : "Male"})
df

,region,tenure,age,income,marital,address,ed,employ,retire,gender,reside,custcat,income_level,senior_citizen,years_until_retirement
0,2,13,44,64,1,9,4,5,0,Female,2,A,Medium,0,16
1,3,11,33,136,1,7,5,5,0,Female,6,D,High,0,27
2,3,68,52,116,1,24,1,29,0,Male,2,C,High,0,8
3,2,33,33,33,0,12,2,0,0,Male,1,A,Low,0,27
4,2,23,30,30,1,9,1,2,0,Female,4,C,Low,0,30
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,3,10,39,27,0,0,3,0,0,Male,3,A,Low,0,21
996,1,7,34,22,0,2,5,5,0,Male,1,A,Low,0,26
997,3,67,59,944,0,40,5,33,0,Male,1,D,High,0,1
998,3,70,49,87,0,18,2,22,0,Male,1,C,Medium,0,11
999,3,50,36,39,1,7,3,3,0,Male,3,B,Low,0,24